function [ Sats ] = AutoPositioning4( R )
    % Расчет коодинат для четырех маяков
    % 6 уравнений -8 координат из них 3 известных: x1 = 0; y1 = 0; y2 = 0;
    % неизвестных - 5, вектор состояния: X = [x2; x3; y3; x4; y4];
    
    % задаем начальное значение вектора состояния (рандомно)
    X = [4 5 5 6 6]';  
    
    % МНК
    for i = 1:12 % число итераций (можно выбрать другой критерий останова
        H = mH(X); % формирование градиентной матрицы
        Y = mF(X); % формирования экстраполяции измерений
        X = X + H'*H\H'*(R - Y); % шаг мнк
    end
    Sats = [0.00 0.00;
            X(1) 0.00;
            X(2) X(3);
            X(4) X(5)]';
      
end

function [F] = mF( X ) % формирования экстраполяции измерений

    X1 = [0;0];
    X2 = [X(1);0];
    X3 = [X(2);X(3)];
    X4 = [X(4);X(5)];
    
    F = [norm(X2 - X1);
         norm(X3 - X1);
         norm(X4 - X1);
         norm(X3 - X2);
         norm(X4 - X2);
         norm(X4 - X3);];
end


function H = mH( X ) % формирование градиентной матрицы
    
    X1 = [0;0];
    X2 = [X(1);0];
    X3 = [X(2);X(3)];
    X4 = [X(4);X(5)];
    
    H = zeros(6,5);
    
    H(1,1) = (X2(1) - X1(1))/norm(X2 - X1);
    H(1,2) = 0;
    H(1,3) = 0;
    H(1,4) = 0;
    H(1,5) = 0;
    
    H(2,1) = 0;
    H(2,2) = (X3(1) - X1(1))/norm(X3 - X1);
    H(2,3) = (X3(2) - X1(2))/norm(X3 - X1);
    H(2,4) = 0;
    H(2,5) = 0;
    
    H(3,1) = 0;
    H(3,2) = 0;
    H(3,3) = 0;
    H(3,4) = (X4(1) - X1(1))/norm(X4 - X1);
    H(3,5) = (X4(2) - X1(2))/norm(X4 - X1);
    
    H(4,1) = -(X3(1) - X2(1))/norm(X3 - X2);
    H(4,2) = (X3(1) - X2(1))/norm(X3 - X2);
    H(4,3) = (X3(2) - X2(2))/norm(X3 - X2);
    H(4,4) = 0;
    H(4,5) = 0;
    
    H(5,1) = -(X4(1) - X2(1))/norm(X4 - X2);
    H(5,2) = 0;
    H(5,3) = 0;
    H(5,4) = (X4(1) - X2(1))/norm(X4 - X2);
    H(5,5) = (X4(2) - X2(2))/norm(X4 - X2);
    
    H(6,1) = 0;
    H(6,2) = -(X4(1) - X3(1))/norm(X4 - X3);
    H(6,3) = -(X4(2) - X3(2))/norm(X4 - X3);
    H(6,4) = (X4(1) - X3(1))/norm(X4 - X3);
    H(6,5) = (X4(2) - X3(2))/norm(X4 - X3);
    
end

